---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodDetachFromHangerError
source: html/4539f141-ce51-dd5f-ea3c-878fee5b167b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodDetachFromHangerError Property

The rod need to be detached from hanger.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationRodDetachFromHangerError { get; }
```